let ukr = ["Авдеевка","Александрия","Александровск","Алёшки","Алмазная","Алчевск","Амвросиевка","Ананьев","Андрушёвка","Антрацит","Апостолово","Артёмовск (Кипучее)","Арциз","Ахтырка","Балаклея","Балта","Бар","Барановка","Барвенково","Батурин","Бахмач","Бахмут","Баштанка","Белая Церковь","Белгород-Днестровский","Белз","Белицкое","Белозёрское","Белополье","Беляевка","Бердичев","Бердянск","Берегово","Бережаны","Березань","Березно","Березо́вка","Берестечко","Берислав","Бершадь","Бобринец","Бобрка","Бобровица","Богодухов","Богуслав","Болград","Болехов","Борзна","Борислав","Борисполь","Борщёв","Боярка","Бровары","Броды","Брянка","Бурштын","Бурынь","Буск","Буча","Бучач","Валки","Вараш (Кузнецовск)","Васильевка","Васильков","Ватутино","Вахрушево","Вашковцы","Великие Мосты","Верхнеднепровск","Верховцево","Вижница","Вилково","Винники","Винница","Виноградов","Вишнёвое","Владимир-Волынский","Вознесенск","Волноваха","Волочиск","Волчанск","Вольногорск","Вольнянск","Ворожба","Вышгород","Гадяч","Гайворон","Гайсин","Галич","Геническ","Герца","Глобино","Глухов","Глиняны","Гнивань","Голая Пристань","Горишние Плавни","Горловка","Горное","Горняк","Городенка","Городище","Городня","Городок","Городок","Горохов","Гребёнка","Гуляйполе","Дебальцево","Деражня","Дергачи","Днепр","Днепрорудное","Добромиль","Доброполье","Докучаевск","Долина","Долинская","Донецк","Дрогобыч","Дружба","Дружковка","Дубляны","Дубно","Дубровица","Дунаевцы","Енакиево","Жашков","Ждановка","Железное","Жёлтые Воды","Жидачов","Житомир","Жмеринка","Жолква","Заводское","Залещики","Запорожье","Заставна","Збараж","Зборов","Звенигородка","Здолбунов","Зеленодольск","Зеньков","Зимогорье","Змиёв","Знаменка","Золотое","Золотоноша","Золочев","Зоринск","Зугрэс","Ивано-Франковск","Измаил","Изюм","Изяслав","Иловайск","Ильинцы","Ирмино","Ирпень","Иршава","Ичня","Кагарлык","Казатин","Калиновка","Калуш","Каменец-Подольский","Каменка","Каменка-Бугская","Каменка-Днепровская","Каменское","Камень-Каширский","Канев","Карловка","Каховка","Киверцы","Киев","Килия","Кировск (Голубовка)","Кировское","Кицмань","Кобеляки","Ковель","Кодыма","Коломыя","Конотоп","Константиновка","Корец","Коростень","Коростышев","Корсунь-Шевченковский","Корюковка","Косов","Костополь","Краматорск","Красилов","Красноград","Краснодон","Краснопартизанск","Красный Луч (Хрустальный)","Кременец","Кременчуг","Кривой Рог","Кролевец","Кропивницкий","Купянск","Ладыжин","Лановцы","Лебедин","Лиман","Лисичанск","Лозовая","Лохвица","Лубны","Луганск","Лутугино","Луцк","Львов","Любомль","Люботин","Малин","Марганец","Мариуполь","Макеевка","Малая Виска","Мелитополь","Мена","Мерефа","Миргород","Мирноград (Димитров)","Мироновка","Миусинск","Могилёв-Подольский","Молодогвардейск","Молочанск","Монастыриска","Монастырище","Мостиска","Мукачево","Надворная","Николаев","Николаев","Никополь","Нежин","Немиров","Нетешин","Новая Каховка","Новая Одесса","Новый Буг","Новоазовск","Нововолынск","Новгород-Северский","Новогродовка","Новомиргород","Новоград-Волынский","Новодружеск","Новоднестровск","Новомосковск","Новопсков","Новоселица","Новоукраинка","Новый Роздол","Носовка","Обухов","Овруч","Одесса","Орехов","Острог","Очаков","Павлоград","Первомайск","Первомайск","Первомайский","Перевальск","Перемышляны","Перечин","Перещепино","Переяслав-Хмельницкий","Першотравенск","Петровское","Пирятин","Погребище","Подволочиск","Подгайцы","Подгородное","Подольск","Покров","Покровск","Пологи","Полонное","Полтава","Попасная","Почаев","Приволье","Прилуки","Приморск","Припять","Пустомыты","Путивль","Пятихатки","Рава-Русская","Радехов","Радомышль","Радивилов","Раздельная","Рахов","Ржищев","Рогатин","Ровеньки","Ровно","Рожище","Ромны","Рубежное","Рудки","Самбор","Сарны","Свалява","Сватово","Свердловск","Светловодск","Северодонецк","Седнев","Селидово","Семёновка","Середина-Буда","Синельниково","Скадовск","Скалат","Сквира","Сколе","Славута","Славутич","Славянск","Смела","Снежное","Снигирёвка","Сновск","Снятын","Сокаль","Сокиряны","Соледар","Старобельск","Староконстантинов","Старый Самбор","Стаханов (Кадиевка)","Сторожинец","Стрый","Сумы","Суходольск","Счастье","Таврийск","Тальное","Тараща","Татарбунары","Теплодар","Тернополь","Терновка","Тетиев","Тысменица","Тлумач","Теребовля","Тростянец","Трускавец","Токмак","Торез","Торецк","Тульчин","Тячев","Угледар","Угнев","Узин","Украинка","Ужгород","Умань","Устилуг","Фастов","Харцызск","Харьков","Херсон","Хмельник","Хмельницкий","Хорол","Хотин","Христиновка","Хуст","Хыров","Червоноград","Червонопартизанск (Вознесеновка)","Черноморск","Черкассы","Чернигов","Чернобыль","Черновцы","Чигирин","Чоп","Чортков","Чугуев","Шаргород","Шахтёрск","Шепетовка","Шостка","Шпола","Шумск","Энергодар","Южное","Южноукраинск","Яворов","Яготин","Ямполь","Яремче","Ясиноватая"];
let kz = ["Абай","Акколь","Аксай","Аксу","Актау","Актобе","Алга","Алма-Ата","Аральск","Аркалык","Арыс","Нур-Султан","Атбасар","Атырау","Аягоз","Байконур","Балхаш","Булаево","Державинск","Ерейментау","Есик","Есиль","Жанаозен","Жанатас","Жаркент","Жезказган","Жем","Жетысай","Житикара","Зайсан","Зыряновск","Казалинск","Кандыагаш","Капшагай","Караганда","Каражал","Каратау","Каркаралинск","Каскелен","Кентау","Кокшетау","Костанай","Кульсары","Курчатов","Кызылорда","Ленгер","Лисаковск","Макинск","Мамлютка","Павлодар","Петропавловск","Приозёрск","Риддер","Рудный","Сарань","Сарканд","Сарыагаш","Сатпаев","Семей","Сергеевка","Серебрянск","Степногорск","Степняк","Тайынша","Талгар","Талдыкорган","Тараз","Текели","Темир","Темиртау","Тобыл","Туркестан","Уральск","Усть-Каменогорск","Ушарал","Уштобе","Форт-Шевченко","Хромтау","ардара","Шалкар","Шар","Шахтинск","Шемонаиха","Шу","Шымкент","Щучинск","Экибастуз","Эмба"];
let rus = ["Абаза","Абакан","Абдулино","Абинск","Агидель","Агрыз","Адыгейск","Азнакаево","Азов","Ак-Довурак","Аксай","Алагир","Алапаевск","Алатырь","Алдан","Алейск","Александров","Александровск","Александровск-Сахалинский","Алексеевка","Алексин","Алзамай","Алупка","Алушта","Альметьевск","Амурск","Анадырь","Анапа","Ангарск","Андреаполь","Анжеро-Судженск","Анива","Апатиты","Апрелевка","Апшеронск","Арамиль","Аргун","Ардатов","Ардон","Арзамас","Аркадак","Армавир","Армянск","Арсеньев","Арск","Артём","Артёмовск","Артёмовский","Архангельск","Асбест","Асино","Астрахань","Аткарск","Ахтубинск","Ачинск","Аша","Бабаево","Бабушкин","Бавлы","Багратионовск","Байкальск","Баймак","Бакал","Баксан","Балабаново","Балаково","Балахна","Балашиха","Балашов","Балей","Балтийск","Барабинск","Барнаул","Барыш","Батайск","Бахчисарай","Бежецк","Белая Калитва","Белая Холуница","Белгород","Белебей","Белёв","Белинский","Белово","Белогорск","Белогорск","Белозерск","Белокуриха","Беломорск","Белоозёрский","Белорецк","Белореченск","Белоусово","Белоярский","Белый","Бердск","Березники","Берёзовский","Берёзовский","Беслан","Бийск","Бикин","Билибино","Биробиджан","Бирск","Бирюсинск","Бирюч","Благовещенск","Благовещенск","Благодарный","Бобров","Богданович","Богородицк","Богородск","Боготол","Богучар","Бодайбо","Бокситогорск","Болгар","Бологое","Болотное","Болохово","Болхов","Большой Камень","Бор","Борзя","Борисоглебск","Боровичи","Боровск","Бородино","Братск","Бронницы","Брянск","Бугульма","Бугуруслан","Будённовск","Бузулук","Буинск","Буй","Буйнакск","Бутурлиновка","Валдай","Валуйки","Велиж","Великие Луки","Великий Новгород","Великий Устюг","Вельск","Венёв","Верещагино","Верея","Верхнеуральск","Верхний Тагил","Верхний Уфалей","Верхняя Пышма","Верхняя Салда","Верхняя Тура","Верхотурье","Верхоянск","Весьегонск","Ветлуга","Видное","Вилюйск","Вилючинск","Вихоревка","Вичуга","Владивосток","Владикавказ","Владимир","Волгоград","Волгодонск","Волгореченск","Волжск","Волжский","Вологда","Володарск","Волоколамск","Волосово","Волхов","Волчанск","Вольск","Воркута","Воронеж","Ворсма","Воскресенск","Воткинск","Всеволожск","Вуктыл","Выборг","Выкса","Высоковск","Высоцк","Вытегра","Вышний Волочёк","Вяземский","Вязники","Вязьма","Вятские Поляны","Гаврилов Посад","Гаврилов-Ям","Гагарин","Гаджиево","Гай","Галич","Гатчина","Гвардейск","Гдов","Геленджик","Георгиевск","Глазов","Голицыно","Горбатов","Горно-Алтайск","Горнозаводск","Горняк","Городец","Городище","Городовиковск","Гороховец","Горячий Ключ","Грайворон","Гремячинск","Грозный","Грязи","Грязовец","Губаха","Губкин","Губкинский","Гудермес","Гуково","Гулькевичи","Гурьевск","Гурьевск","Гусев","Гусиноозёрск","Гусь-Хрустальный","Давлеканово","Дагестанские Огни","Далматово","Дальнегорск","Дальнереченск","Данилов","Данков","Дегтярск","Дедовск","Демидов","Дербент","Десногорск","Джанкой","Дзержинск","Дзержинский","Дивногорск","Дигора","Димитровград","Дмитриев","Дмитров","Дмитровск","Дно","Добрянка","Долгопрудный","Долинск","Домодедово","Донецк","Донской","Дорогобуж","Дрезна","Дубна","Дубовка","Дудинка","Духовщина","Дюртюли","Дятьково","Евпатория","Егорьевск","Ейск","Екатеринбург","Елабуга","Елец","Елизово","Ельня","Еманжелинск","Емва","Енисейск","Ермолино","Ершов","Ессентуки","Ефремов","Железноводск","Железногорск","Железногорск","Железногорск-Илимский","Жердевка","Жигулёвск","Жиздра","Жирновск","Жуков","Жуковка","Жуковский","Завитинск","Заводоуковск","Заволжск","Заволжье","Задонск","Заинск","Закаменск","Заозёрный","Заозёрск","Западная Двина","Заполярный","Зарайск","Заречный","Заречный","Заринск","Звенигово","Звенигород","Зверево","Зеленогорск","Зеленоградск","Зеленодольск","Зеленокумск","Зерноград","Зея","Зима","Златоуст","Злынка","Змеиногорск","Знаменск","Зубцов","Зуевка","Ивангород","Иваново","Ивантеевка","Ивдель","Игарка","Ижевск","Избербаш","Изобильный","Иланский","Инза","Иннополис","Инсар","Инта","Ипатово","Ирбит","Иркутск","Исилькуль","Искитим","Истра","Ишим","Ишимбай","Йошкар-Ола","Кадников","Казань","Калач","Калач-на-Дону","Калачинск","Калининград","Калининск","Калтан","Калуга","Калязин","Камбарка","Каменка","Каменногорск","Каменск-Уральский","Каменск-Шахтинский","Камень-на-Оби","Камешково","Камызяк","Камышин","Камышлов","Канаш","Кандалакша","Канск","Карабаново","Карабаш","Карабулак","Карасук","Карачаевск","Карачев","Каргат","Каргополь","Карпинск","Карталы","Касимов","Касли","Каспийск","Катав-Ивановск","Катайск","Качканар","Кашин","Кашира","Кедровый","Кемерово","Кемь","Керчь","Кизел","Кизилюрт","Кизляр","Кимовск","Кимры","Кингисепп","Кинель","Кинешма","Киреевск","Киренск","Киржач","Кириллов","Кириши","Киров","Киров","Кировград","Кирово-Чепецк","Кировск","Кировск","Кирс","Кирсанов","Киселёвск","Кисловодск","Клин","Клинцы","Княгинино","Ковдор","Ковров","Ковылкино","Когалым","Кодинск","Козельск","Козловка","Козьмодемьянск","Кола","Кологрив","Коломна","Колпашево","Кольчугино","Коммунар","Комсомольск","Комсомольск-на-Амуре","Конаково","Кондопога","Кондрово","Константиновск","Копейск","Кораблино","Кореновск","Коркино","Королёв","Короча","Корсаков","Коряжма","Костерёво","Костомукша","Кострома","Котельники","Котельниково","Котельнич","Котлас","Котово","Котовск","Кохма","Красавино","Красноармейск","Красноармейск","Красновишерск","Красногорск","Краснодар","Краснозаводск","Краснознаменск","Краснознаменск","Краснокаменск","Краснокамск","Красноперекопск","Краснослободск","Краснослободск","Краснотурьинск","Красноуральск","Красноуфимск","Красноярск","Красный Кут","Красный Сулин","Красный Холм","Кремёнки","Кропоткин","Крымск","Кстово","Кубинка","Кувандык","Кувшиново","Кудрово","Кудымкар","Кузнецк","Куйбышев","Кукмор","Кулебаки","Кумертау","Кунгур","Купино","Курган","Курганинск","Курильск","Курлово","Куровское","Курск","Куртамыш","Курчалой","Курчатов","Куса","Кушва","Кызыл","Кыштым","Кяхта","Лабинск","Лабытнанги","Лагань","Ладушкин","Лаишево","Лакинск","Лангепас","Лахденпохья","Лебедянь","Лениногорск","Ленинск","Ленинск-Кузнецкий","Ленск","Лермонтов","Лесной","Лесозаводск","Лесосибирск","Ливны","Ликино-Дулёво","Липецк","Липки","Лиски","Лихославль","Лобня","Лодейное Поле","Лосино-Петровский","Луга","Луза","Лукоянов","Луховицы","Лысково","Лысьва","Лыткарино","Льгов","Любань","Люберцы","Любим","Людиново","Лянтор","Магадан","Магас","Магнитогорск","Майкоп","Майский","Макаров","Макарьев","Макушино","Малая Вишера","Малгобек","Малмыж","Малоархангельск","Малоярославец","Мамадыш","Мамоново","Мантурово","Мариинск","Мариинский Посад","Маркс","Махачкала","Мглин","Мегион","Медвежьегорск","Медногорск","Медынь","Межгорье","Междуреченск","Мезень","Меленки","Мелеуз","Менделеевск","Мензелинск","Мещовск","Миасс","Микунь","Миллерово","Минеральные Воды","Минусинск","Миньяр","Мирный","Мирный","Михайлов","Михайловка","Михайловск","Михайловск","Мичуринск","Могоча","Можайск","Можга","Моздок","Мончегорск","Морозовск","Моршанск","Мосальск","Москва","Муравленко","Мураши","Мурино","Мурманск","Муром","Мценск","Мыски","Мытищи","Мышкин","Набережные Челны","Навашино","Наволоки","Надым","Назарово","Назрань","Называевск","Нальчик","Нариманов","Наро-Фоминск","Нарткала","Нарьян-Мар","Находка","Невель","Невельск","Невинномысск","Невьянск","Нелидово","Неман","Нерехта","Нерчинск","Нерюнгри","Нестеров","Нефтегорск","Нефтекамск","Нефтекумск","Нефтеюганск","Нея","Нижневартовск","Нижнекамск","Нижнеудинск","Нижние Серги","Нижний Ломов","Нижний Новгород","Нижний Тагил","Нижняя Салда","Нижняя Тура","Николаевск","Николаевск-на-Амуре","Никольск","Никольск","Никольское","Новая Ладога","Новая Ляля","Новоалександровск","Новоалтайск","Новоаннинский","Нововоронеж","Новодвинск","Новозыбков","Новокубанск","Новокузнецк","Новокуйбышевск","Новомичуринск","Новомосковск","Новопавловск","Новоржев","Новороссийск","Новосибирск","Новосиль","Новосокольники","Новотроицк","Новоузенск","Новоульяновск","Новоуральск","Новохопёрск","Новочебоксарск","Новочеркасск","Новошахтинск","Новый Оскол","Новый Уренгой","Ногинск","Нолинск","Норильск","Ноябрьск","Нурлат","Нытва","Нюрба","Нягань","Нязепетровск","Няндома","Облучье","Обнинск","Обоянь","Обь","Одинцово","Озёрск","Озёрск","Озёры","Октябрьск","Октябрьский","Окуловка","Олёкминск","Оленегорск","Олонец","Омск","Омутнинск","Онега","Опочка","Орёл","Оренбург","Орехово-Зуево","Орлов","Орск","Оса","Осинники","Осташков","Остров","Островной","Острогожск","Отрадное","Отрадный","Оха","Оханск","Очёр","Павлово","Павловск","Павловский Посад","Палласовка","Партизанск","Певек","Пенза","Первомайск","Первоуральск","Перевоз","Пересвет","Переславль-Залесский","Пермь","Пестово","Петров Вал","Петровск","Петровск-Забайкальский","Петрозаводск","Петропавловск-Камчатский","Петухово","Петушки","Печора","Печоры","Пикалёво","Пионерский","Питкяранта","Плавск","Пласт","Плёс","Поворино","Подольск","Подпорожье","Покачи","Покров","Покровск","Полевской","Полесск","Полысаево","Полярные Зори","Полярный","Поронайск","Порхов","Похвистнево","Почеп","Починок","Пошехонье","Правдинск","Приволжск","Приморск","Приморск","Приморско-Ахтарск","Приозерск","Прокопьевск","Пролетарск","Протвино","Прохладный","Псков","Пугачёв","Пудож","Пустошка","Пучеж","Пушкино","Пущино","Пыталово","Пыть-Ях","Пятигорск","Радужный","Радужный","Райчихинск","Раменское","Рассказово","Ревда","Реж","Реутов","Ржев","Родники","Рославль","Россошь","Ростов-на-Дону","Ростов","Рошаль","Ртищево","Рубцовск","Рудня","Руза","Рузаевка","Рыбинск","Рыбное","Рыльск","Ряжск","Рязань","Саки","Салават","Салаир","Салехард","Сальск","Самара","Санкт-Петербург","Саранск","Сарапул","Саратов","Саров","Сасово","Сатка","Сафоново","Саяногорск","Саянск","Светлогорск","Светлоград","Светлый","Светогорск","Свирск","Свободный","Себеж","Севастополь","Северо-Курильск","Северобайкальск","Северодвинск","Североморск","Североуральск","Северск","Севск","Сегежа","Сельцо","Семёнов","Семикаракорск","Семилуки","Сенгилей","Серафимович","Сергач","Сергиев Посад","Сердобск","Серов","Серпухов","Сертолово","Сибай","Сим","Симферополь","Сковородино","Скопин","Славгород","Славск","Славянск-на-Кубани","Сланцы","Слободской","Слюдянка","Смоленск","Снежинск","Снежногорск","Собинка","Советск","Советск","Советск","Советская Гавань","Советский","Сокол","Солигалич","Соликамск","Солнечногорск","Соль-Илецк","Сольвычегодск","Сольцы","Сорочинск","Сорск","Сортавала","Сосенский","Сосновка","Сосновоборск","Сосновый Бор","Сосногорск","Сочи","Спас-Деменск","Спас-Клепики","Спасск","Спасск-Дальний","Спасск-Рязанский","Среднеколымск","Среднеуральск","Сретенск","Ставрополь","Старая Купавна","Старая Русса","Старица","Стародуб","Старый Крым","Старый Оскол","Стерлитамак","Стрежевой","Строитель","Струнино","Ступино","Суворов","Судак","Суджа","Судогда","Суздаль","Сунжа","Суоярви","Сураж","Сургут","Суровикино","Сурск","Сусуман","Сухиничи","Сухой Лог","Сызрань","Сыктывкар","Сысерть","Сычёвка","Сясьстрой","Тавда","Таганрог","Тайга","Тайшет","Талдом","Талица","Тамбов","Тара","Тарко-Сале","Таруса","Татарск","Таштагол","Тверь","Теберда","Тейково","Темников","Темрюк","Терек","Тетюши","Тимашёвск","Тихвин","Тихорецк","Тобольск","Тогучин","Тольятти","Томари","Томмот","Томск","Топки","Торжок","Торопец","Тосно","Тотьма","Трёхгорный","Троицк","Трубчевск","Туапсе","Туймазы","Тула","Тулун","Туран","Туринск","Тутаев","Тында","Тырныауз","Тюкалинск","Тюмень","Уварово","Углегорск","Углич","Удачный","Удомля","Ужур","Узловая","Улан-Удэ","Ульяновск","Унеча","Урай","Урень","Уржум","Урус-Мартан","Урюпинск","Усинск","Усмань","Усолье-Сибирское","Усолье","Уссурийск","Усть-Джегута","Усть-Илимск","Усть-Катав","Усть-Кут","Усть-Лабинск","Устюжна","Уфа","Ухта","Учалы","Уяр","Фатеж","Феодосия","Фокино","Фокино","Фролово","Фрязино","Фурманов","Хабаровск","Хадыженск","Ханты-Мансийск","Харабали","Харовск","Хасавюрт","Хвалынск","Хилок","Химки","Холм","Холмск","Хотьково","Цивильск","Цимлянск","Циолковский","Чадан","Чайковский","Чапаевск","Чаплыгин","Чебаркуль","Чебоксары","Чегем","Чекалин","Челябинск","Чердынь","Черемхово","Черепаново","Череповец","Черкесск","Чёрмоз","Черноголовка","Черногорск","Чернушка","Черняховск","Чехов","Чистополь","Чита","Чкаловск","Чудово","Чулым","Чусовой","Чухлома","Шагонар","Шадринск","Шали","Шарыпово","Шарья","Шатура","Шахты","Шахунья","Шацк","Шебекино","Шелехов","Шенкурск","Шилка","Шимановск","Шиханы","Шлиссельбург","Шумерля","Шумиха","Шуя","Щёкино","Щёлкино","Щёлково","Щигры","Щучье","Электрогорск","Электросталь","Электроугли","Элиста","Энгельс","Эртиль","Югорск","Южа","Южно-Сахалинск","Южно-Сухокумск","Южноуральск","Юрга","Юрьев-Польский","Юрьевец","Юрюзань","Юхнов","Ядрин","Якутск","Ялта","Ялуторовск","Янаул","Яранск","Яровое","Ярославль","Ярцево","Ясногорск","Ясный","Яхрома"];

class Autocomplete {
    constructor(cities = [], searchField, maxVals = 10, resultListTimeout = 300) {
        if (!document.querySelector(searchField) ||!cities ) {
            return false;
        }

        let letters = [];

        this.searchField = document.querySelector(searchField);
        this.maxVals = maxVals;
        this.resultListTimeout = resultListTimeout;

        this.resultHolder = Autocomplete.createResultHolder(this.searchField, this.resultListTimeout);
        this.sortedCities = {};


        cities.sort(function (a, b) {
            return a.localeCompare(b);
        });

        cities.forEach((item, index, thisArr) => {
            thisArr[index] = item.toUpperCase();
            letters.push(item[0].toUpperCase());
        });

        letters = this.arrUniq(letters);

        letters.forEach(letter => {
            this.sortedCities[letter] = []
        });


        cities.forEach((citiesItem) => {
            letters.forEach((citiesLetter) => {
                if(citiesItem[0]  === citiesLetter) {
                    this.sortedCities[citiesLetter].push(citiesItem);
                }
            })
        });

        this.searchField.addEventListener('input', e => {

            let searchStr = e.target.value;

            if(searchStr !== '' && searchStr[0].toUpperCase() in this.sortedCities){

                searchStr = searchStr.toUpperCase();
                let cities = [...this.sortedCities[searchStr[0]]],
                    template = '';

                if(searchStr.length === 1){

                    let maxVals = this.maxVals;
                    if(cities.length-1 < this.maxVals) {
                        maxVals = cities.length-1;
                    }

                    for(let i = 0; i <= maxVals-1; i++){
                        let cityToDisplay = cities[i].toLowerCase();
                        template += `<li data-city="${cityToDisplay}">${cityToDisplay}</li>`;
                    }

                    this.resultHolder.innerHTML = template;
                    this.showResults();

                } else if(searchStr.length > 1) {
                    let tplCount = 0;
                    for(let i = 0; i <= cities.length-1; i++){
                        let cityToDisplay = cities[i].toLowerCase();
                        if(tplCount === this.maxVals){break}
                        if(cities[i].indexOf(searchStr) !== -1){
                            template += `<li data-city="${cityToDisplay}">${cityToDisplay}</li>`;
                            tplCount++;
                        }
                    }

                    this.resultHolder.innerHTML = template;
                    this.showResults();
                }

                if(this.resultHolder.innerHTML === '') {
                    this.hideResults()
                }

            } else {
                this.hideResults()
            }

        });

        this.resultHolder.addEventListener('click', e => {
            this.searchField.value = e.target.getAttribute('data-city');
            this.hideResults()
        })

    }

    arrUniq(arrArg){
        return arrArg.filter((elem, pos, arr) => {
            return arr.indexOf(elem) === pos;
        });
    }

    showResults(){
        this.resultHolder.style.display = 'block';
        this.resultHolder.style.opacity = '1';
    }

    hideResults(){
        this.resultHolder.style.opacity = '0';
        setTimeout(() => {
            this.resultHolder.style.display = 'none'
        }, this.resultListTimeout);
    }

    static createResultHolder(el, resListTimeout){
        let wrpClass = `_${el.id}Wrapper`;
        let resListClassName = `_${el.id}ResList`;
        let resList = document.createElement('ul');

        el.setAttribute('autocomplete', 'off');

        el.parentElement.classList.add(wrpClass);
        resList.classList.add(resListClassName);
        el.parentElement.appendChild(resList);


        let styles = document.createElement('style');
        let styleValue = `
        .${wrpClass} {
            position: relative;
        }
        
        .${resListClassName}{    
            position: absolute;
            z-index: 10;
            background: white;
            padding: 10px;
            list-style: none;
            margin: 10px 0 0 0;
            box-shadow: 0 0px 13px 0px;
            width: 100%;
            opacity: 0;
            transition: ${resListTimeout / 1000}s;
            left: 0;
        }
        .${resListClassName} li{
            padding: 5px 5px;
            cursor: pointer;
            margin-bottom: 5px;
            transition: .3s;
            border-radius: 3px;
            text-transform: capitalize
        }
        .${resListClassName} li{
            margin-bottom: 0;
        }
        .${resListClassName} li:hover{
            background: rgba(204, 204, 204, 0.5);
        }`;

        styles.innerText = styleValue.replace(/\s{2,}/g, ' ');

        document.head.appendChild(styles);

        return resList;
    }


}

let a  = new Autocomplete([...ukr, ...rus, ...kz], '#searchField');
let b  = new Autocomplete([...ukr, ...rus, ...kz], '#searchField2');